# (R) tidy data

In [20]:
library('tidyverse')

## pivot

- 어떤 항목은 행으로 어떤 항목은 열로 보고자 다룰 때 사용

`-` table4a 예제

In [2]:
table4a

  country     1999   2000
1 Afghanistan    745   2666
2 Brazil       37737  80488
3 China       212258 213766

`pivot_longer` : 행을 항목으로 추가

In [3]:
table4a %>%
pivot_longer(c('1999', '2000'), names_to = "year", values_to = "cases")

  country     year cases
1 Afghanistan 1999    745
2 Afghanistan 2000   2666
3 Brazil      1999  37737
4 Brazil      2000  80488
5 China       1999 212258
6 China       2000 213766

In [4]:
table4a %>%
pivot_longer(c('1999','2000'), names_to = 'year', values_to = 'population')

  country     year population
1 Afghanistan 1999    745
2 Afghanistan 2000   2666
3 Brazil      1999  37737
4 Brazil      2000  80488
5 China       1999 212258
6 China       2000 213766

`-` 위의 두개 합쳐서 보기(merge랑 비슷한 기능인듯)

In [5]:
tidy4a <- table4a %>%
pivot_longer(c('1999', '2000'), names_to = 'year', values_to = 'cases')
tidy4b <- table4b %>%
pivot_longer(c('1999', '2000'), names_to = 'year', values_to = 'population')
left_join(tidy4a, tidy4b)

Joining, by = c("country", "year")

  country     year cases  population
1 Afghanistan 1999    745   19987071
2 Afghanistan 2000   2666   20595360
3 Brazil      1999  37737  172006362
4 Brazil      2000  80488  174504898
5 China       1999 212258 1272915272
6 China       2000 213766 1280428583

`-` table2 예제

In [6]:
table2

   country     year type       count
1  Afghanistan 1999 cases             745
2  Afghanistan 1999 population   19987071
3  Afghanistan 2000 cases            2666
4  Afghanistan 2000 population   20595360
5  Brazil      1999 cases           37737
6  Brazil      1999 population  172006362
7  Brazil      2000 cases           80488
8  Brazil      2000 population  174504898
9  China       1999 cases          212258
10 China       1999 population 1272915272
11 China       2000 cases          213766
12 China       2000 population 1280428583

`pivot_wider` : `pivot_longer`랑 반대로 항목을 행으로 보내기

In [7]:
table2 %>%
pivot_wider(names_from = type, values_from = count)

  country     year cases  population
1 Afghanistan 1999    745   19987071
2 Afghanistan 2000   2666   20595360
3 Brazil      1999  37737  172006362
4 Brazil      2000  80488  174504898
5 China       1999 212258 1272915272
6 China       2000 213766 1280428583

> 결과적으로 `pivot_longer`은 넒은 테이블을 더 좁고 길게 만들고<br>
`pivot_wider`는 긴 테이블을 더 짧고 넓게 만든다.

`-` table3 예제

In [8]:
table3

  country     year rate
1 Afghanistan 1999 745/19987071
2 Afghanistan 2000 2666/20595360
3 Brazil      1999 37737/172006362
4 Brazil      2000 80488/174504898
5 China       1999 212258/1272915272
6 China       2000 213766/1280428583

`separate` : 구분 문자가 나타나는 곳마다 쪼개서 하나의 열을 여러 열로 분리<br>
기본적으로 `separate`는 숫자나 글자가 아닌 문자를 볼 때마다 값을 쪼갠다.<br>
열을 구분하는 특정 문자를 코드에 나타내려면 `sep`을 사용한다.

In [9]:
table3 %>%
separate(rate, into = c("cases", "population"))

  country     year cases  population
1 Afghanistan 1999 745    19987071
2 Afghanistan 2000 2666   20595360
3 Brazil      1999 37737  172006362
4 Brazil      2000 80488  174504898
5 China       1999 212258 1272915272
6 China       2000 213766 1280428583

In [10]:
table3 %>%
separate(rate, into = c("cases", "population"), sep = "/")

  country     year cases  population
1 Afghanistan 1999 745    19987071
2 Afghanistan 2000 2666   20595360
3 Brazil      1999 37737  172006362
4 Brazil      2000 80488  174504898
5 China       1999 212258 1272915272
6 China       2000 213766 1280428583

- 근데 cases, population 문자형 보면 알 수 있듯이 결과가 character로 나온다<br>
이 때 `convert` 사용하면 적합한 열의 유형을 변형해준다.

In [11]:
table3 %>%
separate(
    rate,
    into = c("cases", "population"),
    convert = TRUE
    )

  country     year cases  population
1 Afghanistan 1999    745   19987071
2 Afghanistan 2000   2666   20595360
3 Brazil      1999  37737  172006362
4 Brazil      2000  80488  174504898
5 China       1999 212258 1272915272
6 China       2000 213766 1280428583

- `sep`에 숫자 입력하면 앞에서부터 그 개수만큼 잘라서 분리한다.(음수는 뒤에서부터 자름)

In [12]:
table3 %>%
separate(year, into = c("century", "year"), sep = 2)

  country     century year rate
1 Afghanistan 19      99   745/19987071
2 Afghanistan 20      00   2666/20595360
3 Brazil      19      99   37737/172006362
4 Brazil      20      00   80488/174504898
5 China       19      99   212258/1272915272
6 China       20      00   213766/1280428583

`-` table5 예제

In [13]:
table5

  country     century year rate
1 Afghanistan 19      99   745/19987071
2 Afghanistan 20      00   2666/20595360
3 Brazil      19      99   37737/172006362
4 Brazil      20      00   80488/174504898
5 China       19      99   212258/1272915272
6 China       20      00   213766/1280428583

`unite` : `separate`과 반대로 여러 열을 하나의 열로 결합한다

In [14]:
table5 %>%
unite(new, century, year)

  country     new   rate
1 Afghanistan 19_99 745/19987071
2 Afghanistan 20_00 2666/20595360
3 Brazil      19_99 37737/172006362
4 Brazil      20_00 80488/174504898
5 China       19_99 212258/1272915272
6 China       20_00 213766/1280428583

- sep 사용해서 분리기호 변경( `_` -> 공백)

In [15]:
table5 %>%
unite(new, century, year, sep = "")

  country     new  rate
1 Afghanistan 1999 745/19987071
2 Afghanistan 2000 2666/20595360
3 Brazil      1999 37737/172006362
4 Brazil      2000 80488/174504898
5 China       1999 212258/1272915272
6 China       2000 213766/1280428583

## 결측값

> - 데이터값은 두 가지 방식으로 결측될 수 있다.<br>
> 1) 명시적으로, 즉 NA로 표시된다.<br>
> 2) 암묵적으로, 즉 단순히 데이터에 존재하지 않는다.(이런거 단순히 0으로 놓고가면 문제 생김)

`-` 예시 만들기

In [16]:
stocks <- tibble(
    year = c(2015, 2015, 2015, 2015, 2016, 2016, 2016),
    qtr = c(1, 2, 3, 4, 2, 3, 4),
    return = c(1.88, 0.59, 0.35, NA, 0.92, 0.17, 2.66)
    )

In [17]:
stocks

  year qtr return
1 2015 1   1.88
2 2015 2   0.59
3 2015 3   0.35
4 2015 4     NA
5 2016 2   0.92
6 2016 3   0.17
7 2016 4   2.66

- NA뿐만 아니라 2016년 1분기도 결측값임<br>
아래는 데이터 셋 표현법으로 암묵적 결측값을 명시적 결측값(NA)로 나타내준 모습

In [18]:
stocks %>%
pivot_wider(names_from = year, values_from = return)

  qtr 2015 2016
1 1   1.88   NA
2 2   0.59 0.92
3 3   0.35 0.17
4 4     NA 2.66

`values_drop_na = TRUE` : `pivot_longer`에서 명시적 결측값을 암묵적 결측값으로 전환(위에서는 표시해줬는데 오히려 필요가 없는 경우는 이렇게)

In [19]:
stocks %>%
pivot_wider(names_from = year, values_from = return) %>%
pivot_longer(
    col = c('2015', '2016'),
    names_to = "year",
    values_to = "return",
    values_drop_na = TRUE
    )

  qtr year return
1 1   2015 1.88
2 2   2015 0.59
3 2   2016 0.92
4 3   2015 0.35
5 3   2016 0.17
6 4   2016 2.66

`complete` : 열 집합을 입력으로 하여 거기에 맞는 조합행을 쭉 나열, 이때 비어 있는 데이터의 경우 NA로 표시

In [21]:
stocks %>%
complete(year, qtr)

  year qtr return
1 2015 1   1.88
2 2015 2   0.59
3 2015 3   0.35
4 2015 4     NA
5 2016 1     NA
6 2016 2   0.92
7 2016 3   0.17
8 2016 4   2.66

In [22]:
treatment <- tribble(
    ~person,           ~treatment, ~response,
    "Derrick Whitmore",1,          7,
    NA,                2,          10,
    NA,                3,          9,
    "Katherine Burke", 1,          4
    )

In [23]:
treatment

  person           treatment response
1 Derrick Whitmore 1          7
2 NA               2         10
3 NA               3          9
4 Katherine Burke  1          4

`fill` : 결측값을 가장 최근의 비결측값으로 채움

In [24]:
treatment %>%
fill(person)

  person           treatment response
1 Derrick Whitmore 1          7
2 Derrick Whitmore 2         10
3 Derrick Whitmore 3          9
4 Katherine Burke  1          4

#### 결핵사례 연구

`-` who데이터 사용

In [35]:
who %>% head

  country     iso2 iso3 year new_sp_m014 new_sp_m1524 new_sp_m2534 new_sp_m3544
1 Afghanistan AF   AFG  1980 NA          NA           NA           NA
2 Afghanistan AF   AFG  1981 NA          NA           NA           NA
3 Afghanistan AF   AFG  1982 NA          NA           NA           NA
4 Afghanistan AF   AFG  1983 NA          NA           NA           NA
5 Afghanistan AF   AFG  1984 NA          NA           NA           NA
6 Afghanistan AF   AFG  1985 NA          NA           NA           NA
  new_sp_m4554 new_sp_m5564 ⋯ newrel_m4554 newrel_m5564 newrel_m65 newrel_f014
1 NA           NA           ⋯ NA           NA           NA         NA
2 NA           NA           ⋯ NA           NA           NA         NA
3 NA           NA           ⋯ NA           NA           NA         NA
4 NA           NA           ⋯ NA           NA           NA         NA
5 NA           NA           ⋯ NA           NA           NA         NA
6 NA           NA           ⋯ NA           NA           NA         NA
  newrel_f1524 newrel_f2534 newrel_f3544 newrel_f4554 newrel_f5564 newrel_f65
1 NA           NA           NA           NA           NA           NA
2 NA           NA           NA           NA           NA           NA
3 NA           NA           NA           NA           NA           NA
4 NA           NA           NA           NA           NA           NA
5 NA           NA           NA           NA           NA           NA
6 NA           NA           NA           NA           NA           NA

- 데이터셋이 굉장히 복잡하다<br>
보통 이럴 때에는 변수가 아닌 열을 모으는 것부터 시작하는 것이 좋다.<br>
country, iso2, iso3는 국가를 중복해서 지정하는 세개의 변수이다.<br>
year 또 분명히 변수이다.<br>
다른 모든 열은 아직 무엇인지 알 수 없지만 변수 이름(new_sp_m014등등)의 구조를 보면 이들은 변수가 아니라 값인 것 같다.<br>
그래서 new_sp_m014들은 값으로 취급하여 묶어서 행으로 보내고 확실한 변수들을 열에 둔다.

In [33]:
who1 <- who %>%
pivot_longer(
    cols = new_sp_m014:newrel_f65,
    names_to = "key",
    values_to = "cases",
    values_drop_na = TRUE
    )
who1 %>% head

  country     iso2 iso3 year key          cases
1 Afghanistan AF   AFG  1997 new_sp_m014   0
2 Afghanistan AF   AFG  1997 new_sp_m1524 10
3 Afghanistan AF   AFG  1997 new_sp_m2534  6
4 Afghanistan AF   AFG  1997 new_sp_m3544  3
5 Afghanistan AF   AFG  1997 new_sp_m4554  5
6 Afghanistan AF   AFG  1997 new_sp_m5564  2

`-` 새로운 key열의 값을 세어서 구조에 대한 힌트를 얻을 수 있다

In [37]:
who1 %>%
count(key)

   key          n
1  new_ep_f014  1032
2  new_ep_f1524 1021
3  new_ep_f2534 1021
4  new_ep_f3544 1021
5  new_ep_f4554 1017
6  new_ep_f5564 1017
7  new_ep_f65   1014
8  new_ep_m014  1038
9  new_ep_m1524 1026
10 new_ep_m2534 1020
11 new_ep_m3544 1024
12 new_ep_m4554 1020
13 new_ep_m5564 1015
14 new_ep_m65   1018
15 new_sn_f014  1040
16 new_sn_f1524 1022
17 new_sn_f2534 1016
18 new_sn_f3544 1020
19 new_sn_f4554 1018
20 new_sn_f5564 1017
21 new_sn_f65   1019
22 new_sn_m014  1045
23 new_sn_m1524 1030
24 new_sn_m2534 1022
25 new_sn_m3544 1025
26 new_sn_m4554 1027
27 new_sn_m5564 1021
28 new_sn_m65   1020
29 new_sp_f014  3174
30 new_sp_f1524 3194
31 new_sp_f2534 3200
32 new_sp_f3544 3199
33 new_sp_f4554 3204
34 new_sp_f5564 3195
35 new_sp_f65   3197
36 new_sp_m014  3173
37 new_sp_m1524 3209
38 new_sp_m2534 3206
39 new_sp_m3544 3219
40 new_sp_m4554 3223
41 new_sp_m5564 3218
42 new_sp_m65   3209
43 newrel_f014   190
44 newrel_f1524  184
45 newrel_f2534  182
46 newrel_f3544  183
47 newrel_f4554  183
48 newrel_f5564  183
49 newrel_f65    185
50 newrel_m014   190
51 newrel_m1524  182
52 newrel_m2534  183
53 newrel_m3544  184
54 newrel_m4554  184
55 newrel_m5564  185
56 newrel_m65    182

아래는 데이터 사전(?)을 사용하면 알려준다는데..?

> rel은 재발 사례를 의미<br>
ep는 폐외 결핵 사례를 의미<br>
sn은 폐 얼룩으로 보이지 않는 폐결핵의 사례를 의미<br>
sp는 폐 얼룩으로 보이는 폐결핵 사례를 의미<br>
<br>
여섯 번째는 성별<br>
나머지 숫자는 연령대를 나타낸다.<br>
014 -> 0~14세<br>
.<br>
.<br>
.<br>
65 -> 65세 이상

따라서 열 이름의 형식을 수정해야 한다<br>
new_rel이 아니라 newrel 이런식이기에<br>
`str_replace`는 차후에 자세히 설명함

In [39]:
who2 <- who1 %>%
mutate(key = stringr::str_replace(key, "newrel", "new_rel"))
who2 %>% head

  country     iso2 iso3 year key          cases
1 Afghanistan AF   AFG  1997 new_sp_m014   0
2 Afghanistan AF   AFG  1997 new_sp_m1524 10
3 Afghanistan AF   AFG  1997 new_sp_m2534  6
4 Afghanistan AF   AFG  1997 new_sp_m3544  3
5 Afghanistan AF   AFG  1997 new_sp_m4554  5
6 Afghanistan AF   AFG  1997 new_sp_m5564  2

- 위에서 이름 사이에 `_`를 넣었던 것은 분리하기 위함이였다.

In [42]:
who3 <- who2 %>%
separate(key, c("new", "type", "sexage"), sep = "_")
who3 %>% head

  country     iso2 iso3 year new type sexage cases
1 Afghanistan AF   AFG  1997 new sp   m014    0
2 Afghanistan AF   AFG  1997 new sp   m1524  10
3 Afghanistan AF   AFG  1997 new sp   m2534   6
4 Afghanistan AF   AFG  1997 new sp   m3544   3
5 Afghanistan AF   AFG  1997 new sp   m4554   5
6 Afghanistan AF   AFG  1997 new sp   m5564   2

- new열은 상수이므로 제거한다, iso2, iso3도 중복이므로 제거한다.

`select` : -로 하면 그거 빼고 출력해준다

In [44]:
who4 <- who3 %>%
select(-new, -iso2, -iso3)

In [46]:
who4 %>% head

  country     year type sexage cases
1 Afghanistan 1997 sp   m014    0
2 Afghanistan 1997 sp   m1524  10
3 Afghanistan 1997 sp   m2534   6
4 Afghanistan 1997 sp   m3544   3
5 Afghanistan 1997 sp   m4554   5
6 Afghanistan 1997 sp   m5564   2

In [47]:
who5 <- who4 %>%
separate(sexage, c("sex", "age"), sep = 1)

In [48]:
who5

      country     year type sex age  cases
1     Afghanistan 1997 sp   m   014    0
2     Afghanistan 1997 sp   m   1524  10
3     Afghanistan 1997 sp   m   2534   6
4     Afghanistan 1997 sp   m   3544   3
5     Afghanistan 1997 sp   m   4554   5
6     Afghanistan 1997 sp   m   5564   2
7     Afghanistan 1997 sp   m   65     0
8     Afghanistan 1997 sp   f   014    5
9     Afghanistan 1997 sp   f   1524  38
10    Afghanistan 1997 sp   f   2534  36
11    Afghanistan 1997 sp   f   3544  14
12    Afghanistan 1997 sp   f   4554   8
13    Afghanistan 1997 sp   f   5564   0
14    Afghanistan 1997 sp   f   65     1
15    Afghanistan 1998 sp   m   014   30
16    Afghanistan 1998 sp   m   1524 129
17    Afghanistan 1998 sp   m   2534 128
18    Afghanistan 1998 sp   m   3544  90
19    Afghanistan 1998 sp   m   4554  89
20    Afghanistan 1998 sp   m   5564  64
21    Afghanistan 1998 sp   m   65    41
22    Afghanistan 1998 sp   f   014   45
23    Afghanistan 1998 sp   f   1524 350
24    Afghanistan 1998 sp   f   2534 419
25    Afghanistan 1998 sp   f   3544 194
26    Afghanistan 1998 sp   f   4554 118
27    Afghanistan 1998 sp   f   5564  61
28    Afghanistan 1998 sp   f   65    20
29    Afghanistan 1999 sp   m   014    8
30    Afghanistan 1999 sp   m   1524  55
⋮     ⋮           ⋮    ⋮    ⋮   ⋮    ⋮
76017 Zimbabwe    2012 sn   f   5564  516
76018 Zimbabwe    2012 sn   f   65    432
76019 Zimbabwe    2012 ep   m   014   233
76020 Zimbabwe    2012 ep   m   1524  214
76021 Zimbabwe    2012 ep   m   2534  658
76022 Zimbabwe    2012 ep   m   3544  789
76023 Zimbabwe    2012 ep   m   4554  331
76024 Zimbabwe    2012 ep   m   5564  178
76025 Zimbabwe    2012 ep   m   65    182
76026 Zimbabwe    2012 ep   f   014   208
76027 Zimbabwe    2012 ep   f   1524  319
76028 Zimbabwe    2012 ep   f   2534  710
76029 Zimbabwe    2012 ep   f   3544  579
76030 Zimbabwe    2012 ep   f   4554  228
76031 Zimbabwe    2012 ep   f   5564  140
76032 Zimbabwe    2012 ep   f   65    143
76033 Zimbabwe    2013 rel  m   014  1315
76034 Zimbabwe    2013 rel  m   1524 1642
76035 Zimbabwe    2013 rel  m   2534 5331
76036 Zimbabwe    2013 rel  m   3544 5363
76037 Zimbabwe    2013 rel  m   4554 2349
76038 Zimbabwe    2013 rel  m   5564 1206
76039 Zimbabwe    2013 rel  m   65   1208
76040 Zimbabwe    2013 rel  f   014  1252
76041 Zimbabwe    2013 rel  f   1524 2069
76042 Zimbabwe    2013 rel  f   2534 4649
76043 Zimbabwe    2013 rel  f   3544 3526
76044 Zimbabwe    2013 rel  f   4554 1453
76045 Zimbabwe    2013 rel  f   5564  811
76046 Zimbabwe    2013 rel  f   65    725